<?php
// ще вземем центъра на таблицата и ще се въртим около него 
$count_number=0;//ще брои кое действие предприемем може би съвпада с ИНТ но ще се изследва после за ОПТИМИЗ засега така 
$num=12;//размер на таблицата 
// таблична математика 
if($num%2==0)
{
    $key=($num**2+$num)/2;//  важи за четни таблици началния ключ ще е някъде в средата на таблицата но кое от четирите полета ще изследваме после 
}
else
{
$key=($num**2+1)/2;//това ще е началния ключ някъде в средата на таблицата важи за нечетни таблици например 7х7 5х5 9х9
//като ключът е точно в центъра на таблицата 
}
//$key=floor($key);
//echo $key;die;
$int=1;//брои нашите числа тези които с въртят в спирала 
// НАЙ СЛОЖНОТО ТОЗИ КАУНТ ЩЕ ИЗЧИСЛЯВА ПОВЕДЕНИЕТО НА КЛЮЧОВЕТЕ КОЕТО ЩЕ СЕ МЕНИ 
$count_key=1;//------------------------------// ще показва кога и как ще се менят ключовете кога е ++ -- $к=$к+-$нум ;)
$arr[$key]=$int;//задаваме първата стойност на масива 


// три цикъла един в друг които броят  следното 
//  2 пъти едно , 2 пъти две , 2 пъти три , 2 пъти четири , 2 пъти пет и 
// така до последния елемент който го броят само веднъж;
for($i=1;$i<=$num;$i++)
{
    for($e=0;$e<=1;$e++)
    {
        $count_key=$count_key+$i;
        
        for($q=0;$q<$i;$q++)
        
        {            //                 ВНИМАНИЕ
                    //  !   два пъти ще преброи последния ред  !   !
            if(count($arr)==$num*$num){break;}                  // на един ред з'щот ми се р*з***а играта
                                  
            $count_number++;   
            $int++;
            if($i%2==0)
        {
            if($e==0)
            {
              $key--; //$key++ //таблицата върви надясно aко го променим ще върти в друга посока 
            }
            else
            {
                $key=$key+$num;//-$num //таблицата завива надолу 
            }
        }else
        {
            if($e==0)
            {
                $key++;//$key--сменя посоката но заедно сдругите 3 ключа // таблицата отива наляво 
            }
            else
            {
                $key=$key-$num; //+$num //таблицата отива надолу 
            }
        } 
        $arr[$key]=$int; 
        echo  $key.'</br>';
        
              
        
        }
         //echo $count_key;echo'<br/>';
    }
   
    echo '<br/>';
    
}

print_r($arr);////die;
//
//
// 
//  
//   
//          ||            ||
//                  |
//      
//               \____/             smile:       
//        
//          
//
echo "<br/>";echo "<br/>";echo "<br/>";echo "<br/>";echo "<br/>";

for($row=0;$row<$num;$row++)
{
    for($colls=1;$colls<=$num;$colls++)
    {
        if(($num*$row+$colls)<=$num**2)
        {

                echo '||'.$arr[$num*$row+$colls];
            
            
        //{
       // echo '||'.$arr[$num*$row+$colls];
        
        }
       
    }
    echo'<br/>';
}
echo "<br/>";echo "<br/>";echo "<br/>";echo "<br/>";echo "<br/>";
//echo $num**2+1;die;
for($row=0;$row<$num;$row++)
{
    for($colls=1;$colls<=$num;$colls++)
    {
        if(($num*$row+$colls)<=$num**2)
        {

                echo '||'.(($num**2+1)-$arr[$num*$row+$colls]);
            
            
        //{
       // echo '||'.$arr[$num*$row+$colls];
        
        }
       
    }
    echo'<br/>';
}



