<?php

echo 'НАПРАВЕТЕ ПРОГРАМА КОЯТО ИЗВЕЖДА СУМАТА НА ЧИСЛАТА ДО 30 ...';
$summ=0;//променливата ще държи сумата във всеки един момент 
for($i=0;$i<=30;$i++){
  $summ=$summ+$i;
}
echo'<br/>';
echo $summ;
echo '<br/>
    ето и програмата
    <br/>$summ=0;<br/>//променливата ще държи сумата във всеки един момент 
<br/>for($i=0;$i<=30;$i++){
 <br/> $summ=$summ+$i;
}';
?>
<p>още един начин....</p>
<?php
$number=30;//това е числото чиято сума искаме 
//използваме формула 
$summ=($number+1)*($number/2);//презаписване $summ е използвана да се внимава!!
echo '<br/>'.$summ.'ето и кода $number=30; $summ=($number+1)*($number/2);';
for($i=0;$i<=100;$i++){
    $number=$i;
    $summ=($number+1)*($number/2);
    echo $summ.' --е сумата до-- '.$i.'<br/>';
}
?>
<p>по нататък ще се използва за триъгълницете на Флойд-Паскал</p>
